app/controllers/notes_controller.rb

  def index
    @notes = Note.order(created_at: :desc)

    # Filtrar por título si está presente
    @notes = if params.dig(:filters, :title).present?
      Note.where("title ILIKE ?", "%#{params.dig(:filters, :title)}%")
    else
      Note.all
---
SELECT "notes".* FROM "notes" WHERE (title LIKE '%new%' ESCAPE '\') ORDER BY "notes"."created_at" DESC
SELECT "notes".* FROM "notes" ORDER BY "notes"."created_at" DESC, "notes"."title" DESC
SELECT "notes".* FROM "notes" ORDER BY "notes"."created_at" DESC

  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Tests"], ["body", "Esta es una nueva de prueba"], ["created_at", "2024-12-30 00:52:53.363011"], ["updated_at", "2024-12-30 00:52:53.363011"]]

  def update
    respond_to do |format|
      if @note.update(note_params)
---
UPDATE "notes" SET "body" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["body", "prueba de redireccion 2"], ["updated_at", "2024-12-30 00:58:57.434177"], ["id", 13]]

  def destroy
    @note.destroy
---
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 6]]

  def set_note
    @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]